Revit 2024 API
TableSectionData.GetRowHeight Method
 Returns a row's height in feet
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double GetRowHeight(
	int nRow
)
Visual Basic
Public Function GetRowHeight ( _
	nRow As Integer _
) As Double
Visual C++
public:
double GetRowHeight(
	int nRow
)
Parameters
nRow
Type: System.Int32
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The given row number nRow is invalid.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace